extends PanelContainer
@export var 成绩数据:Dictionary
@export var 被选择状态:bool=false
func 查看历史记录() -> void:
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/界面容器/得分".text = var_to_str(int(成绩数据.分数))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/详细信息/容器/判定统计列表/精确度/数值".text="%.2f" %float(成绩数据.精确度)+"%"
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/详细信息/容器/判定统计列表/连击数/数值".text = var_to_str(int(成绩数据.最大连击数))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/判定统计/容器/判定统计列表/完美/数值".text=var_to_str(int(成绩数据.判定详细[0]))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/判定统计/容器/判定统计列表/良好/数值".text=var_to_str(int(成绩数据.判定详细[1]))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/判定统计/容器/判定统计列表/较差/数值".text=var_to_str(int(成绩数据.判定详细[2]))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/判定统计/容器/判定统计列表/很差/数值".text=var_to_str(int(成绩数据.判定详细[3]))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/判定统计/容器/判定统计列表/失误/数值".text=var_to_str(int(成绩数据.判定详细[5]))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/判定统计/容器/判定统计列表/漏击/数值".text=var_to_str(int(成绩数据.判定详细[4]))
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/详细信息/容器/判定统计列表/无瑕度/数值".text="%.2f" %float(成绩数据.无瑕度)
	$"/root/根场景/根界面/结算画面/左列表/结算/界面容器/界面容器/详细信息/容器/判定统计列表/速度/数值".text="%.3f" %float(成绩数据.最快手速)
	$'/root/根场景/根界面/结算画面/界面动画'.play("结算画面竖屏收缩")
	$"/root/根场景/根界面/结算画面/顶栏/节点/顶栏".text="历史成绩"
	pass # Replace with function body.
func 删除选择() -> void:
	if 被选择状态==false:
		被选择状态=true
	else:
		被选择状态=false
	pass # Replace with function body.
